package ch06.book.exercise; 
	// 277쪽 확인문제
public class Exercise01to11 {
	// Exercise 01 : 3번 // 하나의 클래스로 여러 객체를 생성할 수 있다
	// Exercise 02 : 4번 // 클래스 아래에서 변수를 썼다면 그건 필드임
	// Exercise 03 : 4번 // 안해도 됨 (그냥 필드와 메소드는 인스턴스 멤버고 나머지는 스태틱(정적, 클래스) 멤버)
	// Exercise 04 : 3번 // 필드 생성자 메소드 어디든 쓸 수 있다
	// Exercise 05 : 1번 // 객체를 생성하려면 생성자 호출이 반드시 필요하다
	// Exercise 06 : 4번 // 리턴타입이 있으면 반드시 리턴문을 써야함 스테이트먼트를 그렇게 써야댐 // 메소드 오버로딩 : 중복사용 가능
	// Exercise 07 : 2번 
	// Exercise 08 : 2번! // 스태틱 멤버는 인스턴스 멤버에 접근할 수 없음 // 3번은 그 기능이기 때문에 맞다. 인스턴스 뭐 만들지말라
	// Exercise 09 : 2번 
	// Exercise 10 : 4번
	// Exercise 11 : 3번! // 해당 패키지 내에서만 사용을 허가한다
	
}
